import React, { useMemo } from 'react'
import { NavLink, useLocation } from 'react-router-dom'

export default function TermsAndConditions() {
    const location = useLocation()
    useMemo(() => {
        window.scroll({
          top: 0,
          left: 0,
          behavior: "smooth"
        });
      }, [])
    return (
        <>
            <div className='bg-black text-white lg:py-16 md:py-12 sm:py-8 py-4 lg:my-5 md:my-4 sm:my-3 my-2'>
                <h2 className="text-center lg:text-7xl md:text-6xl sm:text-5xl text-4xl font-semibold">الشروط والاحكام</h2>
                <h2 className='text-center mt-4 lg:text-[22px] md:text-[20px] sm:text-[18px] text-[16px]'><NavLink to="/">الرئيسية </NavLink>{location.pathname}</h2>
            </div>
            <div className='px-5 xl:px-32 lg:px-20 md:px-16 sm:px-10 xl:my-8 lg:my-6   my-4'>
                <div className='my-7'>
                    <h2 className='md:text-2xl sm:text-xl text-lg font-bold text-white'>الشروط والاحكام
                    </h2>
                    <p className='mt-4 text-gray-500 tracking-wider'>هذه الشروط والأحكام (“شروط”، “اتفاقية”) هي اتفاقية بين عماد افندي (“عماد افندي”، “إنا”، “نحن”، “ملكنا”) وانت (“المستخدم”، “انت”، أو “ملكك”). حيث تحدد هذه الاتفاقية الشروط والأحكام العامة التي تحكم استخدامك لموقع emadafandi.com وأي من خدماته أو منتجاته (“موقع إلكتروني”، أو “خدمات”).
                    </p>
                </div>
                <div className='my-7'>
                    <h2 className='md:text-2xl sm:text-xl text-lg font-bold text-white'>الحساب والعضوية

                    </h2>
                    <p className='mt-4 text-gray-500 tracking-wider'>إذا قمت بإنشاء حساب على هذا الموقع الإلكتروني، فأنت من يتحمل مسؤولية الحفاظ على تأمين حسابك بالإضافة الى تحمل مسؤولية جميع الأنشطة التي تتم من خلال هذا الحساب أو أي من الأنشطة الأخرى التي تتعلق به. وربما نقوم، بدون الزام، بمراقبة ومراجعة الحسابات الجديدة قبل أن تقوم بتسجيل الدخول واستخدام خدماتنا. فلو ثبت أن الحساب يقدم معلومات اتصال خاطئة، فسوف يتم إيقاف الحساب فوراً. لذا، عليكم التواصل معنا وابلاغنا في الحال بأي محاولة لاستخدام موقعكم بشكل غير مسموح أو أي حالات اختراق لأمن حسابكم. حيث أننا لن نتحمل مسؤولية أفعالكم وأخطائكم، بما في ذلك أي أضرار من أي نوع تحدث نتيجة لهذه الأفعال أو الأخطاء. لذا، من الممكن ان نقوم بإيقاف، تعليق، أو إزالة حسابكم (أو أي من أجزائه) إذا ثبت مخالفتكم لأي من بنود هذه الاتفاقية أو أدى المحتوى الذي تقدمونه الى الاضرار بموقعنا وتشويه صورته. فإذا تم إزالة حسابكم لأي من الأسباب المذكورة أعلاه، فمن الممكن ألا تتمكنون من إعادة التسجيل في موقعنا مرة أخرى. حيث أنه يمكننا حظر عنوان البريد الإلكتروني وعنوان بروتوكول الإنترنت لمنعكم من التسجيل مرة أخرى.
                    </p>
                </div>
                <div className='my-7'>
                    <h2 className='md:text-2xl sm:text-xl text-lg font-bold text-white'>إرسال الفواتير والدفع
                    </h2>
                    <p className='mt-4 text-gray-500 tracking-wider'>يتم دفع الرسوم والتكاليف لحسابكم بموجب شروط وأحكام الرسوم، التكاليف، والفواتير المعمول بها في وقت وجوب الدفع. ويتم تبادل المعلومات الخاصة والحساسة بين الموقع ومستخدمين تحت غطاء أمني SSL ويتم تشفيرها وحمايتها أثناء عملية النقل. فلو، في اعتقادك، رأيت أن عملية الشراء التي تقوم بها تمثل حساسية ومخاطرة عالية، فسوف نطلب منك ارسال نسخة من بطاقة الهوية السارية الخاصة بك وأيضاً ربما نطلب منك تزويدنا بنسخة من كشف حساب مصرفي حديث لبطاقة الائتمان أو بطاقة الإيداع المستخدمة في الشراء. أيضاً، يحق لنا تغيير المنتجات وتسعير المنتجات في أي وقت بالإضافة إلى انه يحق لنا رفض أي طلب لا نريد إتمامه لك في أي وقت. أيضاً يمكن، بحرية تصرفنا، أن نقوم بتحديد أو الغاء الكميات التي يتم شرائها لكل شخص، عائلة، أو طلب. وتشتمل هذه القيود الطلبات التي يتم شرائها من نفس حساب العميل، نفس بطاقة الائتمان، أو الطلبات التي تستخدم نفس عنوان الشحن. وفي حالة قمنا بتغيير أو إلغاء طلب، فسوف نقوم بإبلاغك من خلال التواصل معك عبر بريدك الالكتروني، عنوان الشحن، ورقم الهاتف المقدم لدينا.
                    </p>
                </div>
                <div className='my-7'>
                    <h2 className='md:text-2xl sm:text-xl text-lg font-bold text-white'>دقة المعلومات
                    </h2>
                    <p className='mt-4 text-gray-500 tracking-wider'>ربما يكون هناك في بعض الأحيان معلومات على الموقع بها أخطاء املائية، بعض الخفقات، أو عدم الدقة والتي تتعلق الاعلانات والعروض. ويحق لنا تصحيح أي أخطاء، خفقات، أو عدم دقة، وأن نقوم بتغيير أو تحديث المعلومات أو الغاء الطلبات إذا كانت هناك أي معلومات غير دقيقة على الموقع أو أي من خدماته في أي وقت وبدون إشعار مسبق (حتى بعد أن يتم تقديم الطلب). أيضاً نحن غير ملتزمين بتحديث، تحسين، أو توضيح أي معلومات متوفرة على موقعنا، بما ذلك، على سبيل المثال لا الحصر، معلومات التسعير، ما عدا ما يتطلب القانون. ولا يوجد هناك تاريخ معين لتحديث المعلومات على الموقع يمكن استخدامه للإشارة الى أن جميع المعلومات على الموقع أو أي من خدماته المتعلقة تم تعديلها أو تحديثها.
                    </p>
                </div>
                <div className='my-7'>
                    <h2 className='md:text-2xl sm:text-xl text-lg font-bold text-white'>النسخ الاحتياطية

                    </h2>
                    <p className='mt-4 text-gray-500 tracking-wider'>نحن لا نتحمل مسؤولية المحتوى الموجود على الموقع. وبأي حال من الأحول لن نتحمل مسؤولية فقدان أي من هذا المحتوى. ولكنها مسؤوليتكم الخاصة أن تحتفظوا بنسخة احتياطية من المحتوى الخاص بكم. ومع ذلك، فربما، في بعض الأحيان وفي بعض الظروف، بدون أي التزام، أن نكون قادرين على استرجاع جزء من أو كل بياناتك التي تم ازالتها، وذلك في حالة قيامنا بالاحتفاظ بنسخ احتياطية من هذه البيانات لأغراض خاصة بنا. ولكن لا نعدكم بأن يتوفر لدينا البيانات التي تحتاجون إليها.

                    </p>
                </div>
                <div className='my-7'>
                    <h2 className='md:text-2xl sm:text-xl text-lg font-bold text-white'>الروابط لمواقع أخرى
                    </h2>
                    <p className='mt-4 text-gray-500 tracking-wider'>بالرغم ان هذا الموقع ربما يكون مرتبطاً بمواقع أخرى، فإننا لا نصرح، بشكل مباشر أو غير مباشر، بأي موافقة، علاقة، رعاية، إقرار، أو علاقة بأي مواقع أخرى، إن لم نذكر هذا بشكل صريح. حيث اننا لا نتحمل مسؤولية فحص أو تقييم، ولا نضمن العروض لهم، أي من الشركات او الأشخاص أو المحتوى المتوفر على مواقعهم. أيضاً لا نتحمل مسؤولية أي من الأفعال، المنتجات، الخدمات، والمحتوى المتوفر لدى أي جهات خارجية. لذا، يجب عليكم مراجعة البيانات القانونية وشروط وأحكام استخدام أي موقع يتم الوصول إليه عبر موقعنا.
                    </p>
                </div>
                <div className='my-7'>
                    <h2 className='md:text-2xl sm:text-xl text-lg font-bold text-white'>التغييرات والتعديلات
                    </h2>
                    <p className='mt-4 text-gray-500 tracking-wider'>يحق لنا تعديل هذه الاتفاقية أو أي من السياسات المتعلقة بهذا الموقع أو خدماته في أي وقت، وتصبح فعالة بعد نشر النسخة المحدثة من هذه الاتفاقية على الموقع وعندما يتم القيام بذلك، فسوف يتم وضع تاريخ التحديث في أسفل هذه الصفحة. وباستمرار استخدامكم لهذا الموقع بعد إضافة هذه التغييرات، فهذا موافقة منكم على هذه التغييرات.
                    </p>
                </div>
                <div className='my-7'>
                    <h2 className='md:text-2xl sm:text-xl text-lg font-bold text-white'>قبول هذه الشروط
                    </h2>
                    <p className='mt-4 text-gray-500 tracking-wider'>تقر بأنك قرأت هذه الاتفاقية وتوافق على جميع شروطها وأحكامها. وباستخدامكم للموقع أو أي من خدماته، فهذا دليل على موافقتكم على الالتزام بهذه الاتفاقية. فإذا كنت لا توافق على هذه الاتفاقية ولا على الالتزام بها، فغير مصرح لكم استخدام أو تصفح موقعنا أو أي من خدماته.
                    </p>
                </div>
                <div className='my-7'>
                    <h2 className='md:text-2xl sm:text-xl text-lg font-bold text-white'>التواصل معنا
                    </h2>
                    <p className='mt-4 text-gray-500 tracking-wider'>إذا كنت تريد التواصل معنا لفهم المزيد حول هذه الاتفاقية أو بخصوص أي أمر متعلق بالموقع، فيمكنكم التواصل معنا عبر استمارة الاتصال
                    </p>
                </div>

                
                <p className='mt-7 text-gray-500 tracking-wider font-bold'>تم تحديث هذه الوثيقة آخر مرة في 15مايو 2021.
                    </p>
            </div>
        </>
    )
}
